# ExportLinetypeKey Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLinetypeKey Constructor
ExportLinetypeKey Class See Also
---
Constructs a new default ExportLinetypeKey.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLinetypeKey()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLinetypeKey()
```

# See Also
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace